# برنامه‌ریز روزانه
print("====== برنامه‌ریز روزانه ======")
print("چند ساعت برای هر کار وقت داری؟\n")

# گرفتن اطلاعات از کاربر
درس = float(input("ساعت درس: "))
ورزش = float(input("ساعت ورزش: "))
استراحت = float(input("ساعت استراحت: "))
کار = float(input("ساعت کارهای دیگر: "))

# محاسبه
مجموع = درس + ورزش + استراحت + کار

if مجموع > 24:
    print("\n⚠️ مجموع ساعت‌ها از ۲۴ بیشتر شد!")
else:
    خواب = 24 - مجموع
    print("\n====== برنامه‌ات ======")
    print("📚 درس:", درس, "ساعت")
    print("🏃 ورزش:", ورزش, "ساعت")
    print("😴 استراحت:", استراحت, "ساعت")
    print("🛠 کارهای دیگر:", کار, "ساعت")
    print("💤 خواب:", خواب, "ساعت")
    print("\n✅ برنامه‌ت آماده است!")